Create Log Analytics Workspace

Create a Sentinel Instance and connect it to Log Analytics

Configure the “Windows Security Events via AMA” connector

Create the DCR within sentinel, watch for extension creation

Query for logs

Observe some of your VM logs:

SecurityEvent
| where EventId == 4625
